knieriem/tinygo-stm32-svd/svd/stm32h7r.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EXTI</name>
      <description>Extended interrupt and event controller</description>
      <groupName>EXTI</groupName>
      <baseAddress>0x58000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PVD_AVD</name>
        <description>PVD and AVD through the EXTI line</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>LOOKUP</name>
        <description>LOOKUP/Overstack</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>CACHE_ECC</name>
        <description>Error ECC cache</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>ECC_FPU</name>
        <description>ECC/FPU/ All flag from exec</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>FPU</name>
        <description>FPU safety Flag</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>EXTI0</name>
        <description>EXTI Line 0 interrupt through the EXTI line</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>EXTI1</name>
        <description>EXTI Line 1 interrupt through the EXTI line</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>EXTI2</name>
        <description>EXTI Line 2 interrupt through the EXTI line</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>EXTI3</name>
        <description>EXTI Line 3 interrupt through the EXTI line</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>EXTI4</name>
        <description>EXTI Line 4 interrupt through the EXTI line</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>EXTI5</name>
        <description>EXTI Line 5 interrupt through the EXTI line</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>EXTI6</name>
        <description>EXTI Line 6 interrupt through the EXTI line</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>EXTI7</name>
        <description>EXTI Line 7 interrupt through the EXTI line</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>EXTI8</name>
        <description>EXTI Line 8 interrupt through the EXTI line</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>EXTI9</name>
        <description>EXTI Line 9 interrupt through the EXTI line</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>EXTI10</name>
        <description>EXTI Line 10 interrupt through the EXTI line</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>EXTI11</name>
        <description>EXTI Line 11 interrupt through the EXTI line</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>EXTI12</name>
        <description>EXTI Line 12 interrupt through the EXTI line</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>EXTI13</name>
        <description>EXTI Line 13 interrupt through the EXTI line</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>EXTI14</name>
        <description>EXTI Line 14 interrupt through the EXTI line</description>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>EXTI15</name>
        <description>EXTI Line 15 interrupt through the EXTI line</description>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>WAKEUP_PIN</name>
        <description>Interrupt for 4 wakeup pins (1, 2, 3, 4)through EXTI line</description>
        <value>132</value>
      </interrupt>
      <registers>
        <register>
          <name>RTSR1</name>
          <displayName>RTSR1</displayName>
          <description>EXTI rising trigger selection register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TR0</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR1</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR2</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR3</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR4</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR5</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR6</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR7</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR8</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR9</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR10</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR11</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR12</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR13</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR14</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR15</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR16</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR17</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR18</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR19</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR20</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR21</name>
              <description>Rising trigger event configuration bit of configurable event input x.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR1</name>
          <displayName>FTSR1</displayName>
          <description>EXTI falling trigger selection register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TR0</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR1</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR2</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR3</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR4</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR5</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR6</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR7</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR8</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR9</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR10</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR11</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR12</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR13</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR14</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR15</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR16</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR17</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR18</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR19</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR20</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TR21</name>
              <description>Falling trigger event configuration bit of configurable event input x.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
