knieriem/tinygo-stm32-svd/svd/stm32h7r.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GFXTIM</name>
      <description>Graphic timer</description>
      <baseAddress>0x50004000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GFXTIM</name>
        <description>GFXTIM global interrupt</description>
        <value>94</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>GFXTIM configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TES</name>
              <description>tearing source
This field selects the tearing-effect source.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEPOL</name>
              <description>tearing--effect polarity
This bit selects the tearing-effect polarity.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCS</name>
              <description>synchronization source
This field selects the synchronization signals (HSYNC and VSYNC) sources.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCCOE</name>
              <description>frame-clock calibration output enable
This bit enables the frame-clock output.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCCOE</name>
              <description>line-clock calibration output enable
This bit enables the line-clock output.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CGCR</name>
          <displayName>CGCR</displayName>
          <description>GFXTIM clock generator configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LCS</name>
              <description>line clock source
This field configures the line clock source.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCCCS</name>
              <description>line clock counter clock source
This bit configures the clock source for the line clock counter.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCCFR</name>
              <description>line clock counter force reload
This bit forces line clock counter reload.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LCCHRS</name>
              <description>line clock counter hardware reload source
This field configures the hardware reload source for the line clock counter.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCS</name>
              <description>frame clock source
This field configures the frame clock source</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCCCS</name>
              <description>frame clock counter clock source
This field configures the clock source for the frame clock counter.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCCFR</name>
              <description>frame clock counter force reload
This bit forces frame clock counter reload</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FCCHRS</name>
              <description>frame- -clock counter hardware reload source
This field configures the hardware reload source for the frame- -clock counter.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR</name>
          <displayName>TCR</displayName>
          <description>GFXTIM timers configuration register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AFCEN</name>
              <description>absolute frame counter enable
This bit enables the absolute frame counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAFCR</name>
              <description>force absolute frame counter reset
This bit forces the reset of the absolute frame counter.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ALCEN</name>
              <description>absolute line counter enable
This bit enables the absolute line counter.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FALCR</name>
              <description>force absolute line counter reset
This bit forces the reset of the absolute line counter.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RFC1EN</name>
              <description>relative frame counter 1 enable
This bit enables the relative frame counter 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RFC1CM</name>
              <description>relative frame counter 1 continuous mode
This bit enables the continuous mode of the relative frame counter 1.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRFC1R</name>
              <description>force relative frame counter 1 reload
This bit forces the reload of the relative frame counter 1.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RFC2EN</name>
              <description>relative frame counter 2 enable
This bit enables the relative frame counter 2.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RFC2CM</name>
              <description>relative frame counter 2 continuous mode
This bit enables the continuous mode of the relative frame counter 2.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRFC2R</name>
              <description>force relative frame counter 2 reload
This bit forces the reload of the relative frame counter 2.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TDR</name>
          <displayName>TDR</displayName>
          <description>GFXTIM timers disable register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AFCDIS</name>
              <description>absolute frame counter disable
This bit disables the absolute frame counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ALCDIS</name>
              <description>absolute line counter disable
This bit disables the absolute line counter.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RFC1DIS</name>
              <description>relative frame counter 1 disable
This bit disables the relative frame counter 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RFC2DIS</name>
              <description>relative frame counter 2 disable
This bit disables the relative frame counter 2.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCR</name>
          <displayName>EVCR</displayName>
          <description>GFXTIM events control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EV1EN</name>
              <description>event 1 enable
This bit enables the complex event 1 generation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EV2EN</name>
              <description>event 2 enable
This bit enables the complex event 2 generation.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EV3EN</name>
              <description>event 3 enable
This bit enables the complex event 3 generation.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EV4EN</name>
              <description>event 4 enable
This bit enables the complex event 4 generation.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSR</name>
          <displayName>EVSR</displayName>
          <description>GFXTIM events selection register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LES1</name>
              <description>line-event selection 1
This field defines the line-event selection for complex event 1 generation.
others: reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FES1</name>
              <description>frame-event selection 1
This field defines the frame-event selection for complex event 1 generation.
others: reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LES2</name>
              <description>line-event selection 2
This field defines the line-event selection for complex event 2 generation.
others: reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FES2</name>
              <description>frame-event selection 2
This field defines the frame-event selection for complex event 2 generation.
others: reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LES3</name>
              <description>line-event selection 3
This field defines the line-event selection for complex event 3 generation.
others: reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FES3</name>
              <description>frame-event selection 3
This field defines the frame-event selection for complex event 3 generation.
others: reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LES4</name>
              <description>line-event selection 4
This field defines the line-event selection for complex event 4 generation.
others: Reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FES4</name>
              <description>frame-event selection 4
This field defines the frame-event selection for complex event 4 generation.
others: reserved</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDGTCR</name>
          <displayName>WDGTCR</displayName>
          <description>GFXTIM watchdog timer configuration register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WDGEN</name>
              <description>watchdog enable
This bit enables the graphic watchdog.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDGDIS</name>
              <description>watchdog disable
This bit disables the graphic watchdog.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDGS</name>
              <description>watchdog status
This bit returns the status of the graphic watchdog.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDGHRC</name>
              <description>watchdog hardware reload configuration
This field configures the watchdog hardware reload.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDGCS</name>
              <description>watchdog clock source
This field selects the watchdog clock source.
others: reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FWDGR</name>
              <description>force watchdog reload
This bit forces the reload of the graphic watchdog.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <displayName>ISR</displayName>
          <description>GFXTIM interrupt status register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AFCOF</name>
              <description>absolute frame counter overflow flag
This bit indicates an overflow occurred on the absolute frame counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALCOF</name>
              <description>absolute line counter overflow flag
This bit indicates an overflow occurred on the absolute line counter.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEF</name>
              <description>tearing-effect flag
This bit indicates a tearing effect event occurred.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AFCC1F</name>
              <description>absolute frame counter compare 1 flag
This bit indicates match on compare 1 of the absolute frame counter.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALCC1F</name>
              <description>absolute line counter compare 1 flag
This bit indicates match on compare 1 of the absolute line counter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALCC2F</name>
              <description>absolute line counter compare 2 flag
This bit indicates match on compare 2 of the absolute line counter.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC1RF</name>
              <description>relative frame counter 1 reload flag
This bit indicates relative frame counter 1 has been reloaded.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC2RF</name>
              <description>relative frame counter 2 reload flag
This bit indicates relative frame counter 2 has been reloaded.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EV1F</name>
              <description>event 1 flag
This bit indicates a complex event 1 occurred.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EV2F</name>
              <description>event 2 flag
This bit indicates a complex event 2 occurred.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EV3F</name>
              <description>event 3 flag
This bit indicates a complex event 3 occurred.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EV4F</name>
              <description>event 4 flag
This bit indicates a complex event 4 occurred.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDGAF</name>
              <description>watchdog alarm flag
This bit indicates that a graphic watchdog alarm occurred.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDGPF</name>
              <description>watchdog pre-alarm flag
This bit indicates that a graphic watchdog pre-alarm occurred.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
