knieriem/tinygo-stm32-svd/svd/stm32h7r.svd
        <register>
          <name>ICR</name>
          <displayName>ICR</displayName>
          <description>GFXTIM interrupt clear register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CAFCOF</name>
              <description>clear absolute frame counter overflow flag
This bit clears AFCOF in GXTIM_ISR.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CALCOF</name>
              <description>clear absolute line counter overflow flag
This bit clears ALCOF in GXTIM_ISR.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEF</name>
              <description>clear tearing-effect flag
This bit clears TEF in GXTIM_ISR.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CAFCC1F</name>
              <description>clear absolute frame counter compare 1 flag
This bit clears AFCC1F in GXTIM_ISR.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CALCC1F</name>
              <description>clear absolute line counter compare 1 flag
This bit clears ALCC1F in GXTIM_ISR.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CALCC2F</name>
              <description>clear absolute line counter compare 2 flag
This bit clears ALCC2F in GXTIM_ISR.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CRFC1RF</name>
              <description>clear relative frame counter 1 reload flag
This bit clears RFC1RF in GXTIM_ISR.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CRFC2RF</name>
              <description>clear relative frame counter 2 reload flag
This bit clears RFC2RF in GXFXTIM_ISR.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CEV1F</name>
              <description>clear event 1 flag
This bit EV1F in GXFXTIM_ISR.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CEV2F</name>
              <description>clear event 2 flag
This bit clears EV2F in GXFXTIM_ISR.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CEV3F</name>
              <description>clear event 3 flag
This bit clears EV3F in GXFXTIM_ISR.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CEV4F</name>
              <description>clear event 4 flag
This bit clears EV4F in GXFXTIM_ISR.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CWDGAF</name>
              <description>clear watchdog alarm flag
This bit clears WDGAF in GXFXTIM_ISR.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CWDGPF</name>
              <description>clear watchdog pre-alarm flag
This bit clears WDGPF in GXFXTIM_ISR.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <displayName>IER</displayName>
          <description>GFXTIM interrupt enable register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AFCOIE</name>
              <description>absolute frame counter overflow interrupt enable
This bit enables the absolute frame counter overflow interrupt generation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALCOIE</name>
              <description>absolute line counter overflow interrupt enable
This bit enables the absolute line counter overflow interrupt generation.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEIE</name>
              <description>tearing-effect interrupt enable
This bit enables the Tearing Effect interrupt generation.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFCC1IE</name>
              <description>absolute frame counter compare 1 interrupt enable
This bit enables the absolute frame counter compare interrupt generation.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALCC1IE</name>
              <description>absolute line counter compare 1 interrupt enable
This bit enables the absolute line counter compare 1 interrupt generation.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALCC2IE</name>
              <description>absolute line counter compare 2 interrupt enable
This bit enables the absolute line counter compare 2 interrupt generation.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFC1RIE</name>
              <description>relative frame counter 1 reload interrupt enable
This bit enables the relative frame counter 1 reload interrupt generation.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFC2RIE</name>
              <description>relative frame counter 2 reload interrupt enable
This bit enables the relative frame counter 2 reload interrupt generation.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EV1IE</name>
              <description>event 1 interrupt enable
This bit enables the complex event 1 interrupt generation.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EV2IE</name>
              <description>event 2 interrupt enable
This bit enables the complex event 2 interrupt generation.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EV3IE</name>
              <description>event 3 interrupt enable
This bit enables the complex event 3 interrupt generation.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EV4IE</name>
              <description>event 4 interrupt enable
This bit enables the complex event 4 interrupt generation.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDGAIE</name>
              <description>watchdog alarm interrupt enable
This bit enables the watchdog alarm interrupt generation.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDGPIE</name>
              <description>watchdog pre-alarm interrupt enable
This bit enables the watchdog pre-alarm interrupt generation.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSR</name>
          <displayName>TSR</displayName>
          <description>GFXTIM timers status register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AFCS</name>
              <description>absolute frame counter status
This bit returns the status of the absolute frame counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALCS</name>
              <description>absolute line counter status
This bit returns the status of the absolute line counter.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC1S</name>
              <description>relative frame counter 1 status
This bit returns the status of the relative frame counter 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RFC2S</name>
              <description>relative frame counter 2 status
This bit returns the status of the relative frame counter 2.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCCRR</name>
          <displayName>LCCRR</displayName>
          <description>GFXTIM line clock counter reload register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RELOAD</name>
              <description>reload value
Reload value of the line clock counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCCRR</name>
          <displayName>FCCRR</displayName>
          <description>GFXTIM frame clock counter reload register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RELOAD</name>
              <description>reload value
Reload value of the frame clock counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ATR</name>
          <displayName>ATR</displayName>
          <description>GFXTIM absolute time register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINE</name>
              <description>line number
Current value of the absolute line counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRAME</name>
              <description>fame number
Current value of the absolute frame counter.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFCR</name>
          <displayName>AFCR</displayName>
          <description>GFXTIM absolute frame counter register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRAME</name>
              <description>frame number
Current value of the absolute frame counter.
Note: This field can only be written when the absolute frame counter is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALCR</name>
          <displayName>ALCR</displayName>
          <description>GFXTIM absolute line counter register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINE</name>
              <description>line number
Current value of the absolute line counter.
Note: This field can only be written when the absolute frame counter is disabled.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFCC1R</name>
          <displayName>AFCC1R</displayName>
          <description>GFXTIM absolute frame counter compare 1 register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRAME</name>
              <description>frame number
Compare 1 value for the absolute frame counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALCC1R</name>
          <displayName>ALCC1R</displayName>
          <description>GFXTIM absolute line counter compare 1 register</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINE</name>
              <description>line number
Compare value 1 for the absolute line counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALCC2R</name>
          <displayName>ALCC2R</displayName>
          <description>GFXTIM absolute line counter compare 2 register</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LINE</name>
              <description>line number
Compare value 2 for the absolute line counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFC1R</name>
          <displayName>RFC1R</displayName>
          <description>GFXTIM relative frame counter 1 register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRAME</name>
              <description>frame number
Current value of the relative frame counter 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFC1RR</name>
          <displayName>RFC1RR</displayName>
          <description>GFXTIM relative frame counter 1 reload register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRAME</name>
              <description>frame reload value
Reload value for the relative frame counter 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFC2R</name>
          <displayName>RFC2R</displayName>
          <description>GFXTIM relative frame counter 2 register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRAME</name>
              <description>frame number
Current value of the relative frame counter 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RFC2RR</name>
          <displayName>RFC2RR</displayName>
          <description>GFXTIM relative frame counter 2 reload register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRAME</name>
              <description>frame reload value
Reload value for the relative frame counter 2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDGCR</name>
          <displayName>WDGCR</displayName>
          <description>GFXTIM watchdog counter register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>value
Current value of the watchdog counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDGRR</name>
          <displayName>WDGRR</displayName>
          <description>GFXTIM watchdog reload register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RELOAD</name>
              <description>reload value
Reload value of the watchdog counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDGPAR</name>
          <displayName>WDGPAR</displayName>
          <description>GFXTIM watchdog pre-alarm register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PREALARM</name>
              <description>pre-alarm value
Pre-alarm value of the watchdog counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
