knieriem/tinygo-stm32-svd/svd/stm32h7r.svd
        <register>
          <name>APB4RSTR</name>
          <displayName>APB4RSTR</displayName>
          <description>RCC APB4 peripheral reset register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SBSRST</name>
              <description>SBS block reset
Set and reset by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SBSRST</name>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Reset the selected module</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPUART1RST</name>
              <description>LPUART1 block reset
Set and reset by software.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SBSRST"/>
            </field>
            <field>
              <name>SPI6RST</name>
              <description>SPI/I2S6 block reset
Set and reset by software.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SBSRST"/>
            </field>
            <field>
              <name>LPTIM2RST</name>
              <description>LPTIM2 block reset
Set and reset by software.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SBSRST"/>
            </field>
            <field>
              <name>LPTIM3RST</name>
              <description>LPTIM3 block reset
Set and reset by software.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SBSRST"/>
            </field>
            <field>
              <name>LPTIM4RST</name>
              <description>LPTIM4 block reset
Set and reset by software.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SBSRST"/>
            </field>
            <field>
              <name>LPTIM5RST</name>
              <description>LPTIM5 block reset
Set and reset by software.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SBSRST"/>
            </field>
            <field>
              <name>VREFRST</name>
              <description>VREF block reset
Set and reset by software.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SBSRST"/>
            </field>
            <field>
              <name>TMPSENSRST</name>
              <description>TMPSENS block reset
Set and reset by software.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="SBSRST"/>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB3RSTR</name>
          <displayName>AHB3RSTR</displayName>
          <description>RCC AHB3 peripheral reset register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RNGRST</name>
              <description>random number generator block reset
Set and reset by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>RNGRST</name>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Reset the selected module</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HASHRST</name>
              <description>HASH block reset
Set and reset by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="RNGRST"/>
            </field>
          </fields>
        </register>
        <register>
          <name>CKGDISR</name>
          <displayName>CKGDISR</displayName>
          <description>RCC AXI clocks gating disable register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AXICKG</name>
              <description>AXI interconnect matrix clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBMCKG</name>
              <description>AXI master AHB clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDMMC1CKG</name>
              <description>AXI master SDMMC1 clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPDMA1CKG</name>
              <description>AXI master HPDMA1 clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPUCKG</name>
              <description>AXI master CPU clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPUS0CKG</name>
              <description>AXI master 0 GPU clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPUS1CKG</name>
              <description>AXI master 1 GPU clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPUCLCKG</name>
              <description>AXI master cache GPU clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCMIPPCKG</name>
              <description>AXI master DCMIPP clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2DCKG</name>
              <description>AXI master DMA2D clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GFXMMUSCKG</name>
              <description>AXI matrix slave GFXMMU clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LTDCCKG</name>
              <description>AXI master LTDC clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GFXMMUMCKG</name>
              <description>AXI master GFXMMU clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBSCKG</name>
              <description>AXI slave AHB clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMCCKG</name>
              <description>AXI slave FMC and MCE3 clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XSPI1CKG</name>
              <description>AXI slave XSPI1 and MCE1 clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XSPI2CKG</name>
              <description>AXI slave XSPI2 and MCE2 clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIRAM4CKG</name>
              <description>AXI matrix slave SRAM4 clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIRAM3CKG</name>
              <description>AXI matrix slave SRAM3 clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIRAM2CKG</name>
              <description>AXI slave SRAM2 clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIRAM1CKG</name>
              <description>AXI slave SRAM1 / error code correction (ECC) clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLITFCKG</name>
              <description>AXI slave Flash interface (FLIFT) clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTICKG</name>
              <description>EXTI clock gating disable
This bit is set and reset by software.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JTAGCKG</name>
              <description>JTAG automatic clock gating disabling
This bit is set and reset by software.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1DIVR2</name>
          <displayName>PLL1DIVR2</displayName>
          <description>RCC PLL1 dividers configuration register 2</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIVS</name>
              <description>PLL1 DIVS division factor
Set and reset by software to control the frequency of the pll1_s_ck clock.
This post-divider performs divisions with 50% duty-cycle. 
The duty-cycle of 50% is guaranteed only in the following conditions:
With VCOL, if (DIVS+1) is even,
With VCOH, for all DIVS values
These bits can be written only when the PLL1DIVSEN = 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVT</name>
              <description>PLL1 DIVT division factor
Set and reset by software to control the frequency of the pll1_t_ck clock.
This post-divider performs divisions with 50% duty-cycle. 
The duty-cycle of 50% is guaranteed only in the following conditions:
With VCOL, if (DIVT+1) is even,
With VCOH, for all DIVT values
These bits can be written only when the PLL1DIVTEN = 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL2DIVR2</name>
          <displayName>PLL2DIVR2</displayName>
          <description>RCC PLL2 dividers configuration register 2</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIVS</name>
              <description>PLL2 DIVS division factor
Set and reset by software to control the frequency of the pll2_s_ck clock.
This post-divider performs divisions with 50% duty-cycle. 
The duty-cycle of 50% is guaranteed only in the following conditions:
With VCOL, if (DIVS+1) is even,
With VCOH, for all DIVS values
These bits can be written only when the PLL2DIVSEN = 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVT</name>
              <description>PLL2 DIVT division factor
Set and reset by software to control the frequency of the pll2_t_ck clock.
This post-divider performs divisions with 50% duty-cycle. 
The duty-cycle of 50% is guaranteed only in the following conditions:
With VCOL, if (DIVT+1) is even,
With VCOH, for all DIVT values
These bits can be written only when the PLL2DIVTEN = 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3DIVR2</name>
          <displayName>PLL3DIVR2</displayName>
          <description>RCC PLL3 dividers configuration register 2</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIVS</name>
              <description>PLL3 DIVS division factor
Set and reset by software to control the frequency of the pll3_s_ck clock.
This post-divider performs divisions with 50% duty-cycle. 
The duty-cycle of 50% is guaranteed only in the following conditions:
With VCOL, if (DIVS+1) is even,
With VCOH, for all DIVS values
These bits can be written only when the PLL3DIVSEN = 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVT</name>
              <description>PLL3 DIVT division factor
Set and reset by software to control the frequency of the pll3_t_ck clock.
This post-divider performs divisions with 50% duty-cycle. 
The duty-cycle of 50% is guaranteed only in the following conditions:
With VCOL, if (DIVT+1) is even,
With VCOH, for all DIVT values
These bits can be written only when the PLL3DIVTEN = 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1SSCGR</name>
          <displayName>PLL1SSCGR</displayName>
          <description>RCC PLL1 Spread Spectrum Clock Generator register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MOD_PER</name>
              <description>Modulation Period Adjustment for PLL1
Set and reset by software to adjust the modulation period of the clock spreading generator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TPDFN_DIS1</name>
              <description>Dithering TPDF noise control for PLL1
Set and reset by software.
This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a triangular probability density function.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPDFN_DIS1</name>
              <description>Dithering RPDF noise control for PLL1
Set and reset by software.
This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a rectangular probability density function.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWNSPREAD1</name>
              <description>Spread spectrum clock generator mode for PLL1
Set and reset by software to select the clock spreading mode.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INC_STEP</name>
              <description>Modulation Depth Adjustment for PLL1
Set and reset by software to adjust the modulation depth of the clock spreading generator.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL2SSCGR</name>
          <displayName>PLL2SSCGR</displayName>
          <description>RCC PLL2 Spread Spectrum Clock Generator register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MOD_PER</name>
              <description>Modulation Period Adjustment for PLL2
Set and reset by software to adjust the modulation period of the clock spreading generator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TPDFN_DIS2</name>
              <description>Dithering TPDF noise control for PLL2
Set and reset by software.
This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a triangular probability density function.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPDFN_DIS2</name>
              <description>Dithering RPDF noise control for PLL2
Set and reset by software.
This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a rectangular probability density function.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWNSPREAD2</name>
              <description>Spread spectrum clock generator mode for PLL2
Set and reset by software to select the clock spreading mode.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INC_STEP</name>
              <description>Modulation Depth Adjustment for PLL2
Set and reset by software to adjust the modulation depth of the clock spreading generator.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
