knieriem/tinygo-stm32-svd/svd/stm32h7r.svd
        <register>
          <name>CCSWVALR</name>
          <displayName>CCSWVALR</displayName>
          <description>SBS compensation cell for I/Os software value register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000088</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_NSRC</name>
              <description>Software NMOS transistors slew-rate compensation
This bitfield returns the NMOS transistors slew-rate compensation value computed by the cell. It is interpreted to compensate the NMOS transistors slew rate in the functional range if COMP_CODESEL = 1 in SBS_CCCSR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_PSRC</name>
              <description>Software PMOS transistors slew-rate compensation
This bitfield returns the PMOS transistors slew-rate compensation value computed by the cell. It is interpreted to compensate the PMOS transistors slew rate in the functional range if COMP_CODESEL = 1 in SBS_CCCSR register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCTO1_SW_NSRC</name>
              <description>XSPIM_P1 software NMOS transistors slew-rate compensation
This bitfield returns the NMOS transistors slew -ate compensation value computed by the cell. It is interpreted by XSPIM_P1 to compensate the NMOS transistors slew rate in the functional range if OCTO1_COMP_CODESEL = 1 in SBS_CCCSR register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCTO1_SW_PSRC</name>
              <description>XSPIM_P1 software PMOS transistors slew-rate compensation
This bitfield returns the PMOS transistors slew-rate compensation value computed by the cell. It is interpreted by XSPIM_P1 to compensate the PMOS transistors slew rate in the functional range if OCTO1_COMP_CODESEL = 1 in SBS_CCCSR register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCTO2_SW_NSRC</name>
              <description>XSPIM_P2 software NMOS transistors slew-rate compensation
This bitfield returns the NMOS transistors slew-rate compensation value computed by the cell. It is interpreted by XSPIM_P2 to compensate the NMOS transistors slew rate in the functional range if OCTO2_COMP_CODESEL = 1 in SBS_CCCSR register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCTO2_SW_PSRC</name>
              <description>XSPIM_P2 software PMOS transistors slew-rate compensation
This bitfield returns the PMOS transistors slew-rate compensation value computed by the cell. It is interpreted by XSPIM_P2 to compensate the PMOS transistors slew rate in the functional range if OCTO2_COMP_CODESEL = 1 in SBS_CCCSR register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BKLOCKR</name>
          <displayName>BKLOCKR</displayName>
          <description>SBS break lockup register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000088</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PVD_BL</name>
              <description>PVD break lock
This bit is set by SW and cleared only by a system reset. it can be used to enable and lock the connection to TIM1/8/15/16/17Break input as well as the PVDE and PLS[2:0] bitfields in the PWR_CR1 register.
Once set, this bit is cleared only by a system reset.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASHECC_BL</name>
              <description>Flash ECC error break lock
Set this bit to enable and lock the connection between embedded flash memory ECC double error detection flag and break inputs of TIM1/15/16/17 peripherals.
Once set, this bit is cleared only by a system reset.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CM7LCKUP_BL</name>
              <description>Cortex-M7 lockup break lock
Set this bit to enable and lock the connection between the Cortex-M7 lockup (HardFault) output and break inputs of TIM1/15/16/17 peripherals.
Once set, this bit is cleared only by a system reset.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BKRAMECC_BL</name>
              <description>Backup RAM ECC error break lock
Set this bit to enable and lock the connection between backup RAM ECC double error detection flag and break inputs of TIM1/15/16/17 peripherals.
Once set, this bit is cleared only by a system reset.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTCMECC_BL</name>
              <description>DTCM ECC error break lock
Set this bit to enable and lock the connection between DTCM ECC double error detection flag and break inputs of TIM1/15/16/17 peripherals.
Once set, this bit is cleared only by a system reset.
Note: The DTCM0 and DTCM1 are Ored to give DTCMECC</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ITCMECC_BL</name>
              <description>ITCM ECC error break lock
Set this bit to enable and lock the connection between ITCM ECC double error detection flag and break inputs of TIM1/15/16/17 peripherals.
Once set, this bit is cleared only by a system reset.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARAM3ECC_BL</name>
              <description>AXIRAM3 ECC error break lock
Set this bit to enable and lock the connection between AXIRAM3 ECC double error detection flag and break inputs of TIM1/15/16/17 peripherals.
Once set this bit is cleared only by a system reset.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ARAM1ECC_BL</name>
              <description>AXIRAM1 ECC error break lock
Set this bit to enable and lock the connection between AXIRAM1 ECC double error detection flag and break inputs of TIM1/15/16/17 peripherals.
Once set, this bit is cleared only by a system reset.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR1</name>
          <displayName>EXTICR0</displayName>
          <description>SBS external interrupt configuration register 0</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PC_EXTI0</name>
              <description>Port configuration EXTI {0 * 4 + i}
This bitfield selects the source input to the EXTI input {0 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_EXTI1</name>
              <description>Port configuration EXTI {0 * 4 + i}
This bitfield selects the source input to the EXTI input {0 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_EXTI2</name>
              <description>Port configuration EXTI {0 * 4 + i}
This bitfield selects the source input to the EXTI input {0 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_EXTI3</name>
              <description>Port configuration EXTI {0 * 4 + i}
This bitfield selects the source input to the EXTI input {0 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR2</name>
          <displayName>EXTICR1</displayName>
          <description>SBS external interrupt configuration register 1</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PC_EXTI4</name>
              <description>Port configuration EXTI {1 * 4 + i}
This bitfield selects the source input to the EXTI input {1 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_EXTI5</name>
              <description>Port configuration EXTI {1 * 4 + i}
This bitfield selects the source input to the EXTI input {1 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_EXTI6</name>
              <description>Port configuration EXTI {1 * 4 + i}
This bitfield selects the source input to the EXTI input {1 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_EXTI7</name>
              <description>Port configuration EXTI {1 * 4 + i}
This bitfield selects the source input to the EXTI input {1 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR3</name>
          <displayName>EXTICR2</displayName>
          <description>SBS external interrupt configuration register 2</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PC_EXTI8</name>
              <description>Port configuration EXTI {2 * 4 + i}
This bitfield selects the source input to the EXTI input {2 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_EXTI9</name>
              <description>Port configuration EXTI {2 * 4 + i}
This bitfield selects the source input to the EXTI input {2 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_EXTI10</name>
              <description>Port configuration EXTI {2 * 4 + i}
This bitfield selects the source input to the EXTI input {2 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_EXTI11</name>
              <description>Port configuration EXTI {2 * 4 + i}
This bitfield selects the source input to the EXTI input {2 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR4</name>
          <displayName>EXTICR3</displayName>
          <description>SBS external interrupt configuration register 3</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PC_EXTI12</name>
              <description>Port configuration EXTI {3 * 4 + i}
This bitfield selects the source input to the EXTI input {3 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_EXTI13</name>
              <description>Port configuration EXTI {3 * 4 + i}
This bitfield selects the source input to the EXTI input {3 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_EXTI14</name>
              <description>Port configuration EXTI {3 * 4 + i}
This bitfield selects the source input to the EXTI input {3 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC_EXTI15</name>
              <description>Port configuration EXTI {3 * 4 + i}
This bitfield selects the source input to the EXTI input {3 * 4 + i} used for external interrupt/ event detection.
Others: reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
