knieriem/tinygo-stm32-svd/svd/stm32h7r.svd
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>UCPD control register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXMODE</name>
              <description>Type of Tx packet</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>TXMODE</name>
                <enumeratedValue>
                  <name>RegisterSet</name>
                  <description>Transmission of Tx packet previously defined in other registers</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CableReset</name>
                  <description>Cable Reset sequence</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BISTTest</name>
                  <description>BIST test sequence (BIST Carrier Mode 2)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXSEND</name>
              <description>Command to send a Tx packet
The bit is cleared by hardware as soon as the packet transmission begins or is discarded.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>TXSEND</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Start</name>
                  <description>Start Tx packet transmission</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXHRST</name>
              <description>Command to send a Tx Hard Reset
The bit is cleared by hardware as soon as the message transmission begins or is discarded.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>TXHRST</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Start</name>
                  <description>Start Tx Hard Reset message</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXMODE</name>
              <description>Receiver mode
Determines the mode of the receiver.
When the bit is set, RXORDSET behaves normally, RXDR no longer receives bytes yet the CRC checking still proceeds as for a normal message. As this mode prevents reception of the header (containing MessageID), software has to auto-increment a received MessageID counter for inclusion in the GoodCRC acknowledge that must still be transmitted during this test.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>RXMODE</name>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal receive mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIST</name>
                  <description>BIST receive mode (BIST test data mode)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYRXEN</name>
              <description>USB Power Delivery receiver enable
Both CC1 and CC2 receivers are disabled when the bit is cleared. Only the CC receiver selected via the PHYCCSEL bit is enabled when the bit is set.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PHYRXEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>USB Power Delivery receiver disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>USB Power Delivery receiver enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYCCSEL</name>
              <description>CC1/CC2 line selector for USB Power Delivery signaling
The selection depends on the cable orientation as discovered at attach.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PHYCCSEL</name>
                <enumeratedValue>
                  <name>CC1</name>
                  <description>Use CC1 IO for Power Delivery communication</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <description>Use CC2 IO for Power Delivery communication</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANASUBMODE</name>
              <description>Analog PHY sub-mode
Refer to Table 876: Coding for ANAMODE, ANASUBMODE and link with TYPEC_VSTATE_CCx for the effect of this bitfield.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ANASUBMODE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rp_DefaultUSB</name>
                  <description>Default USB Rp</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rp_1_5A</name>
                  <description>1.5A Rp</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rp_3A</name>
                  <description>3A Rp</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANAMODE</name>
              <description>Analog PHY operating mode
The use of CC1 and CC2 depends on CCENABLE. Refer to Table 876: Coding for ANAMODE, ANASUBMODE and link with TYPEC_VSTATE_CCx for the effect of this bitfield in conjunction with ANASUBMODE[1:0].</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ANAMODE</name>
                <enumeratedValue>
                  <name>Source</name>
                  <description>Source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Sink</name>
                  <description>Sink</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCENABLE</name>
              <description>CC line enable
This bitfield enables CC1 and CC2 line analog PHYs (pull-ups and pull-downs) according to ANAMODE and ANASUBMODE[1:0] setting.
A single line PHY can be enabled when, for example, the other line is driven by VCONN via an external VCONN switch. Enabling both PHYs is the normal usage for sink/source.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>CCENABLE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Both PHYs disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1Enabled</name>
                  <description>CC1 PHY enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2Enabled</name>
                  <description>CC2 PHY enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BothEnabled</name>
                  <description>CC1 and CC2 PHYs enabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRSRXEN</name>
              <description>FRS event detection enable
Setting the bit enables FRS Rx event (FRSEVT) detection on the CC line selected through the PHYCCSEL bit. 0: Disable
Clear the bit when the device is attached to an FRS-incapable source/sink.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>FRSRXEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>FRS Rx event detection disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>FRS Rx event detection enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRSTX</name>
              <description>FRS Tx signaling enable.
Setting the bit enables FRS Tx signaling.
The bit is cleared by hardware after a delay respecting the USB Power Delivery specification Revision 3.1.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>FRSTX</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>FRS Tx signaling enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDCH</name>
              <description>Rdch condition drive</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>RDCH</name>
                <enumeratedValue>
                  <name>NoEffect</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ConditionDrive</name>
                  <description>Rdch condition drive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC1TCDIS</name>
              <description>CC1 Type-C detector disable
The bit disables the Type-C detector on the CC1 line.
When enabled, the Type-C detector for CC1 is configured through ANAMODE and ANASUBMODE[1:0].</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>CC1TCDIS</name>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Type-C detector on the CCx line enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Type-C detector on the CCx line disabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CC2TCDIS</name>
              <description>CC2 Type-C detector disable
The bit disables the Type-C detector on the CC2 line.
When enabled, the Type-C detector for CC2 is configured through ANAMODE and ANASUBMODE[1:0].</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="CC1TCDIS"/>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <displayName>IMR</displayName>
          <description>UCPD interrupt mask register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXISIE</name>
              <description>TXIS interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>TXISIE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXMSGDISCIE</name>
              <description>TXMSGDISC interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TXISIE"/>
            </field>
            <field>
              <name>TXMSGSENTIE</name>
              <description>TXMSGSENT interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TXISIE"/>
            </field>
            <field>
              <name>TXMSGABTIE</name>
              <description>TXMSGABT interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TXISIE"/>
            </field>
            <field>
              <name>HRSTDISCIE</name>
              <description>HRSTDISC interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TXISIE"/>
            </field>
            <field>
              <name>HRSTSENTIE</name>
              <description>HRSTSENT interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TXISIE"/>
            </field>
            <field>
              <name>TXUNDIE</name>
              <description>TXUND interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TXISIE"/>
            </field>
            <field>
              <name>RXNEIE</name>
              <description>RXNE interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TXISIE"/>
            </field>
            <field>
              <name>RXORDDETIE</name>
              <description>RXORDDET interrupt enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TXISIE"/>
            </field>
            <field>
              <name>RXHRSTDETIE</name>
              <description>RXHRSTDET interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TXISIE"/>
            </field>
            <field>
              <name>RXOVRIE</name>
              <description>RXOVR interrupt enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TXISIE"/>
            </field>
            <field>
              <name>RXMSGENDIE</name>
              <description>RXMSGEND interrupt enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TXISIE"/>
            </field>
            <field>
              <name>TYPECEVT1IE</name>
              <description>TYPECEVT1 interrupt enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TXISIE"/>
            </field>
            <field>
              <name>TYPECEVT2IE</name>
              <description>TYPECEVT2 interrupt enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="TXISIE"/>
            </field>
            <field>
              <name>FRSEVTIE</name>
              <description>FRSEVT interrupt enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="TXISIE"/>
            </field>
          </fields>
        </register>
