knieriem/tinygo-stm32-svd/svd/stm32h7r.svd
        <register>
          <name>HLCR</name>
          <displayName>HLCR</displayName>
          <description>XSPI HyperBus latency configuration register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LM</name>
              <description>Latency mode
This bit selects the Latency mode.
Note: This bit must be set when using the dual-octal HyperBus configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WZL</name>
              <description>Write zero latency
This bit enables zero latency on write operations.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TACC</name>
              <description>Access time
Device access time expressed in number of communication clock cycles</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRWR</name>
              <description>Read write recovery time
Device read write recovery time expressed in number of communication clock cycles</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFCR</name>
          <displayName>CALFCR</displayName>
          <description>XSPI full-cycle calibration configuration</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FINE</name>
              <description>Fine calibration
The unitary value of delay for this field depends on product technology (refer to the product datasheet).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COARSE</name>
              <description>Coarse calibration
The unitary value of delay for this field depends on product technology (refer to the product datasheet).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CALMAX</name>
              <description>Max value
This bit gets set when the memory-clock period is outside the range of DLL master, in which case XSPI_CALFCR and XSPI_CALSR are updated with the values for the maximum delay.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALMR</name>
          <displayName>CALMR</displayName>
          <description>XSPI DLL master calibration configuration</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FINE</name>
              <description>Fine calibration
The unitary value of delay for this field depends on product technology (refer to the product datasheet).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COARSE</name>
              <description>Coarse calibration
The unitary value of delay for this field depends on product technology (refer to the product datasheet).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALSOR</name>
          <displayName>CALSOR</displayName>
          <description>XSPI DLL slave output calibration configuration</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FINE</name>
              <description>Fine calibration
The unitary value of delay for this field depends on product technology (refer to the product datasheet).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COARSE</name>
              <description>Coarse calibration
The unitary value of delay for this field depends on product technology (refer to the product datasheet).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALSIR</name>
          <displayName>CALSIR</displayName>
          <description>XSPI DLL slave input calibration configuration</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FINE</name>
              <description>Fine calibration
The unitary value of delay for this field depends on product technology (refer to the product datasheet).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COARSE</name>
              <description>Coarse calibration
The unitary value of delay for this field depends on product technology (refer to the product datasheet).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
